// let userAge = prompt ("Сколько тебе лет")
// if (userAge < 6) {
//     alert("ТІ ребенок")
    
// } else if (userAge < 17) {
//     alert("Ти школьник")

// }
    

// else {
//     alert("Ті старик")
// }










// let a = prompt("Введите число а")
    
//     b = prompt("Введите число б") 
// if (a > b ){
//     alert("первое число больше второго")
// }
// if (a < b ){
//     alert("Второе число больше первого")
// }
// if (a == b ){
//     alert("Они равни")
// }

// let c = prompt("Третье число ")
//     d = prompt("Четвертое число")
// if ( c > d ){
//     alert("первое число больше второго")
// }
// if (c < d ){
// alert("Второе число больше первого")
// }
// if (c == d ){
// alert("Они равни")
// }


// if ( a > c ){
//     alert("первое число больше второго")
// }
// if (a < c ){
// alert("Второе число больше первого")
// }
// if (a == c ){
// alert("Они равни")
// }


// if ( a > d ){
//     alert("первое число больше второго")
// }
// if ( a < d ){
// alert("Второе число больше первого")
// }
// if (a == d ){
// alert("Они равни")
// }


// if ( b > c ){
//     alert("первое число больше второго")
// }
// if ( b < c ){
// alert("Второе число больше первого")
// }
// if ( b == c ){
// alert("Они равни")
// }

// if ( b > d ){
//     alert("первое число больше второго")
// }
// if ( b < d ){
// alert("Второе число больше первого")
// }
// if ( d == d ){
// alert("Они равни")
// }


// let a = prompt("Введите число а")
    
//     b = prompt("Введите число б") 
// if (a > b ){
//     alert("первое число больше второго")
// }
// if (a < b ){
//     alert("Второе число больше первого")
// }
// if (a == b ){
//     alert("Они равни")
// }

// let c = prompt("Третье число ")
//     d = prompt("Четвертое число")
// if ( c > d ){
//     alert("первое число больше второго")
// }
// if (c < d ){
// alert("Второе число больше первого")
// }
// if (c == d ){
// alert("Они равни")
// }


// if ( a > c ){
//     alert("первое число больше второго")
// }
// if (a < c ){
// alert("Второе число больше первого")
// }
// if (a == c ){
// alert("Они равни")
// }


// if ( a > d ){
//     alert("первое число больше второго")
// }
// if ( a < d ){
// alert("Второе число больше первого")
// }
// if (a == d ){
// alert("Они равни")
// }


// if ( b > c ){
//     alert("первое число больше второго")
// }
// if ( b < c ){
// alert("Второе число больше первого")
// }
// if ( b == c ){
// alert("Они равни")
// }

// if ( b > d ){
//     alert("первое число больше второго")
// }
// if ( b < d ){
// alert("Второе число больше первого")
// }
// if ( d == d ){
// alert("Они равни")
// }

// let = prompt ("Треугольник ровнобедрений")


// if (Да) {
//     alert = ("У него две сторони равни")

// }   
// if (Нет) {
//     alert = ("Разностороний")
// }






// let  user = prompt("Кто ти")

// if (user == "Админ") {
//     alert("Привет")
//     r = prompt("Введите пароль")
//     console.log(r)
// }
// if ( user == "Директор") {
//     alert("Здраствуйте")
// }
// if ( user == "Новий пользиватель") {
//     alert("Пройди регистрацию")
// }


let = prompt("Ви решили задачу")
if (a == "Да") {
    alert("Ви едете домой")
}
else if(a == "Решили за 5 минут") {
        alert("Ден покупает шоколдку")
}
else{
    let b = prompt("Нет")
    alert("остаемся до вечера")
}