// let arr = []
// arr[ ]= ""
// arr[ ]= ""
// arr[ ]= ""
// arr[ ]= ""
// arr[ ]= ""



// arr =["Пн", "Вт", "Ср", "Чт", "Пт",  "Сб" , "Вс" ]
// alert(arr[0] +  " и " + arr [4] + " Экзамен"  ) 



// arr =[ "Жека ", " Саша ", " Миша ", " Дана " ,  " Вова ", " - Получат подарок" ,  " - Не получат подарок"   ]
// alert(arr [0] + " , " + arr [3] + " и " + arr [4] + arr [5])
// alert(arr [1] + " и " + arr [2] + arr [6]  )




// obj ={ "Жека" : "20000", "Дана" : "45000" , "Богдан" : "30000"   }
//     alert(obj ["Богдан"]  )


// arr = {
//     "Жена" : [ "10.000", "15000","20000" ],
// "Саша": [ "100000", "150000", "200000", "350000"  ]

// }
// alert( arr ["Саша"] [3]   )




// arr = {
//     "Мальчик" : [ " Жека ", " Саня "," Вова " ," Бодя " ],
// "Девочка": [ " Дана ", "", "", ""  ]

// }
// alert( arr ["Мальчик"] [0] + arr ["Девочка"] [0] +  arr ["Мальчик"] [3]    )





let a = 1
arr = [ 2, 3, 4, 5 ]
for (i = 0; i < 4 ; i++ )
    { a = arr[i]*a }
        alert(a)